{
  "General Maintenance": [
    {
      "Spare Tire Installation": "What does Spare Tire Installation entail? A customer surprised by a flat tire may want a mechanic to come out and replace the damaged tire with the spare tire."
    },
    {
      "Rotate Tires": "What does Rotate Tires entail? Rotating the tires on a regular basis will significantly extend their lifespan. The cars four tires wear out differently. If one tire wears out more than the others, the car will start pulling in the direction of the newer tires. For example, if you let go of the steering wheel when driving, (for a moment!), the car should continue to go in a straight line. If the tires have worn out differently, the car will not travel in a straight line. It will drift in the direction of the better tire. This is also the reason why when you buy new tires, it is best to buy them in pairs. Rotating your tires will help even out tire wear by allowing each tire to serve in as many of the vehicles wheel positions as possible. During the rotation, the front tires are moved straight back and the rear tires are moved diagonally to the front. This will ensure that every tire will see each corner of the car. Your mechanic should check for abnormal wear, which may be a sign of other problems:"
    },
    {
      "AC Low Pressure Hose Replacement": "What does AC Low Pressure Hose Replacement entail? The AC system has many components: compressor, condenser, receiver dryer, evaporator, and hoses. For an AC system to work, it needs a gas or liquid substance, a refrigerant, (R-12 in older cars, R-134a in 1995 and newer cars). Hoses carry the refrigerant throughout the AC system. A car usually has four or more hoses. The AC system hoses are connected to the evaporator, condenser, dryer, and the compressor."
    },
    {
      "Brake Hose Replacement": "What does Brake Hose Replacement entail? The hydraulic steel brake lines that carry brake fluid in your car are bolted to the frame of the vehicle. These metal brake lines must eventually attach to the individual wheel calipers — or wheel cylinders in the case of drum brakes — at all four wheels. Since the wheels constantly move up and down, or left and right in the case of the front wheels, the brake line that attaches to the individual wheel calipers must be highly flexible. Enter the brake hose: a flexible, synthetic, reinforced-rubber hose designed to withstand the 1,000 PSI plus pressures that occur when you apply the brakes. There is at least one brake hose at each wheel position, and sometimes two depending on the suspension design. At the end of each rubber hose are steel connections with seals to maintain a leak-proof connection."
    },
    {
      "Radiator Hose Replacement": "What does Radiator Hose Replacement entail? Radiator/cooling system hoses are an important part of your cars cooling system, which is designed to keep the engine from overheating. When your car’s engine is running it creates heat. The radiator/cooling system hoses carry coolant through the radiator and back through the engine to keep it operating at an optimal temperature. There are mulitple hoses in a given system. An upper hose connects the top of the radiator to the top of the engine. A lower hose connects the bottom of the radiator to the water pump of the engine, which keeps coolant flowing through the system."
    },
    {
      "Exhaust Gas Recirculation (EGR) Tube Replacement": "What does Exhaust Gas Recirculation (EGR) Tube Replacement entail? The EGR (Exhaust Gas Recirculation) valve helps lower the car’s exhaust emissions (gases from the tailpipe). It recirculates a portion of the gasses coming out of the engine by putting them back into the intake manifold, where the engine can burn them again, reducing emissions. Most engines require exhaust gas recirculation to meet emissions standards. If the EGR valve has gone bad, the car will most likely not pass an emissions test."
    },
    {
      "Power Steering Pressure Hose Replacement": "What does Power Steering Pressure Hose Replacement entail? The power steering pressure hose transfers the high-pressure hydraulic output of the power steering pump to either a steering gear box or steering rack and pinion unit to create the power assist that you rely on when you turn the steering wheel. The pressure hose is only used in cars with a power steering pump and reservoir, so if you have a newer car you may have electric power steering instead. The pressure hose is relatively large in diameter in order to withstand high hydraulic pressure, flex as the engine moves and vibrates, and also withstand engine heat, accidental cuts, and abrasion."
    },
    {
      "Air Injection Hose Replacement": "What does Air Injection Hose Replacement entail? Some cars are equipped with an air injection system to reduce engine emissions. The air injection hoses inject extra air into the car’s exhaust system to convert C0 into C02. The air injection hoses deteriorate over time and need to be replaced."
    },
    {
      "Heater Bypass Tube Replacement": "What does Heater Bypass Tube Replacement entail? The heater bypass tube allows a small amount of coolant to circulate throughout your car engine when the thermostat is closed. It bypasses the thermostat, hence the name. Some engines are equipped with bypass hoses, while others have a bypass passage that forms a part of the cooling jacket in the engine. This is really just terminology – the effect is the same. The bypass tube prevents excessive pressure from being built up within the system, delivers a bit of heat when the engine is started, and allows for even cooling from the point of startup. When the thermostat opens up coolant flow in your car, the engine begins to cool. The car thermostat closes a bit and increases coolant flow through the heater core and the bypass hose."
    },
    {
      "Air Filter Replacement": "What does Air Filter Replacement entail? Your car takes in air and passes it into the engine through the air filter. (Some cars have more than one air filter.) The air filter takes out dust, leaves, and other debris from the air before passing it into the engine where it’s mixed with fuel. The combination of air and fuel is essential for the car to run. If the air filter is dirty or clogged, it will not pass enough air into the engine, causing all sorts of problems (car may not start, engine may not run smoothly, etc.). If you use a reusable air filter (K&N), please specify that in the appointment notes, as you may just need a cleaning instead of a replacement. Unless you bought K&N filter, your car has a regular filter."
    },
    {
      "Cabin Air Filter Replacement": "What does Cabin Air Filter Replacement entail? When you turn on the heat or air conditioner, the air that you get from the car vents originates from outside the car. The cabin air filter cleans the air before passing it through the heating or air conditioning system."
    },
    {
      "Fuel Filter Replacement": "What does Fuel Filter Replacement entail? The fuel filter is made of cellulose or synthetic-based filter media that traps extremely tiny contaminants, such as rust particles and dirt, present in the fuel as it flows from the fuel tank to the fuel injectors. The filter media is sealed within a cylindrical shaped housing that looks like a tiny soda can. You will most often find the fuel filter plumbed into the high-pressure fuel supply line beneath the car, right next to a sturdy frame rail. Some fuel filters, particularly on diesel-powered vehicles, have water traps as well. Some newer cars do not have serviceable fuel filters as the filter is built into the fuel pump located in the fuel tank."
    },
    {
      "AC Air Filter Replacement": "What does AC Air Filter Replacement entail? You might be more familiar with the AC air filter as the cabin filter. This is either a single or a dual-filter setup that is housed inside the car. It sits behind the glovebox, and does a similar job to the engine’s air filter, except for the interior of your vehicle. As air is pumped into the air conditioning system, it inevitably brings with it dust, pollen and other debris. This can be circulated into the car’s cabin, causing problems. An AC air filter helps to remove these particulates and ensure that you have a constant supply of clean, fresh air at all times. Like all air filters, your AC air filter will eventually clog up and need to be replaced. This is done during normal maintenance, and generally performed during scheduled services like a 12k service."
    },
    {
      "Clutch Fluid Replacement": "What does Clutch Fluid Replacement entail? Clutch fluid actually doesn’t exist. Clutch fluid is really just brake fluid that is kept in the clutch master cylinder. When you depress the clutch pedal, this fluid flows from the clutch master cylinder into the slave cylinder. The pressure of the fluid is then used to engage the clutch, which allows you to change gears. After the clutch has been engaged, the clutch pedal will be released, and the fluid will retreat back to the clutch master cylinder."
    },
    {
      "Transfer Case Fluid Replacement": "What does Transfer Case Fluid Replacement entail? The transfer case is a special gear box found in four-wheel and all-wheel-drive vehicles. It sends drive power from the engine to the front and rear axles. In all-wheel-drive vehicles, the transfer case helps to shift power from one axle to another, depending upon traction conditions. Lubricant fluid in the transfer case helps to keep its gears cool and turning smoothly. Replacing this fluid at appropriate intervals can help prevent premature wear and damage caused by contaminated or broken-down lubricant."
    },
    {
      "Brake System Flush": "What does Brake System Flush entail? Brake fluid is essential for the operation of a car’s brakes. When you push the brake pedal, the brake fluid causes the brake pads to press against the rotors, making the car slow down and stop. Over time, the brake fluid absorbs air, moisture, sludge and other contaminants and gets contaminated. Air in the brake fluid causes braking to feel spongy and significantly reduces braking efficiency. A brake system flush includes removing the existing fluid and moisture out of the system and replacing it with new, clean, fluid. A brake fluid flush ensures proper brake system performance and increases the lifespan of your brake system components."
    },
    {
      "Change Oil and Filter": "What does Change Oil and Filter entail? Engine oil is the lifeblood of the engine. The oil resides in the oil pan, which is under the car attached to the bottom of the engine. All internal (moving) parts of the engine need to be lubricated by the engine oil. Inadequate lubrication will cause the parts to wear out faster and eventually lead to engine failure. An oil filter keeps the oil clean and free of debris. If the filter is not replaced on a regular basis, it will get clogged and will not be able to pass oil into the engine."
    },
    {
      "Cooling System Flush": "What does Cooling System Flush entail? Your cooling system is what keeps your car from overheating. It works by circulating a mixture of water and coolant through the engine. Over time the coolant mixture becomes contaminated with scale and rust, which can clog and damage the cooling system components. A cooling system flush essentially flushes out the entire system of contaminants and replaces the coolant mixture with fresh coolant and water."
    },
    {
      "Radiator Flush": "What does Radiator Flush entail? A radiator flush is undertaken to clean out all of the old coolant and anti-freeze mixture in your car’s cooling system. By pumping quantities of radiator cleaning solution through the system, the process removes contaminants, scale and rust particles that build up over time, allowing a new, clean and fresh mixture to take its place."
    },
    {
      "Transmission Fluid Service": "What does Transmission Fluid Service entail? Transmission fluid helps cool and lubricate your vehicle’s transmission’s internal parts. The transmission transfers power from the engine to the wheels of the car. An automatic transmission shifts the car into different gears depending on the speed that you are driving. In an automatic transmission car, the transmission system has an oil pan that contains the transmission fluid and fluid filter. The fluid provides the power/force required to shift into different gears. In manual transmission cars, there is a case that contains the transmission fluid. Contrary to an automatic transmission, the fluid in a manual system is not directly involved in changing gears, because it is a mechanical system, whereas an automatic transmission is hydraulic. If an automatic transmission does not have enough fluid, or the fluid has been contaminated, it is possible for the transmission to start to slip and eventually fail. If a manual transmission does not have enough fluid, or the fluid has been contaminated, it is possible for the transmission to become noisy, the internal parts to wear out faster and eventually for the transmission to fail."
    },
    {
      "Recharge Diesel Emissions Fluid": "What does Recharge Diesel Emissions Fluid entail? Modern so-called clean diesel vehicles use a solution containing urea and ionized water to help control exhaust emissions. The solution is injected into the exhaust stream, where it reacts with the vehicle’s catalyst to reduce harmful emissions in the exhaust stream. The diesel emissions fluid is carried onboard in its own reservoir. They are typically quite large, allowing very extensive mileages before requiring replenishment. The tanks are usually fitted with a special spout connector to ease refills, but they can be located in places that require the removal of other parts."
    },
    {
      "Power Steering Fluid Service": "What does Power Steering Fluid Service entail? Power steering fluid flows through the power steering hydraulic system. The system is pressurised by the power steering pump and by way of valves, plungers, or pistons decreases the effort needed by the driver to turn the steering wheel. When the pump stops pumping, the pressure drops and the power steering system loses its hydraulic pressure. As components in the steering system wear, metal particles will contaminate the fluid, which will cause seals in the system to leak and components to eventually fail. Checking the fluid level and changing the fluid at regular intervals recommended by the manufacturer is important for the life of the hoses, pistons, valves, seals, and the power steering pump itself."
    },
    {
      "Serpentine/Drive Belt Replacement": "What does Serpentine/Drive Belt Replacement entail? A serpentine belt is a relatively long, flat, multi-ribbed belt that is driven by the engine’s crankshaft pulley. The belt drives many, and often all, of the engine accessories such as the alternator, air conditioning compressor, power steering pump, water pump, and air pump. The serpentine belt is tensioned by a hydraulic or spring-loaded automatic tensioner. Some older cars use a serpentine belt to drive most accessories but will also have a shorter v-style belt to drive, for example, the power steering pump."
    },
    {
      "Timing Belt Replacement": "What does Timing Belt Replacement entail? An engine timing belt is a fiber reinforced, toothed drive belt manufactured using durable compounds such as highly saturated nitrile. The timing belt allows the crankshaft to drive the camshafts in the cylinder head at half the RPMs of the crankshaft. The camshafts then open and close the engine’s intake and exhaust valves in time with the movement and position of the pistons in the engine."
    },
    {
      "Drive Belt Tensioner Replacement": "What does Drive Belt Tensioner Replacement entail? A Drive Belt Tensioner is a pulley mounted to either a spring mechanism or to an adjustable pivot point that is used to keep constant tension on your serpentine belt. That is the big long belt in the front of your engine. The tensioner rides on the outside surface of the belt to put pressure, or tension, on the belt and against the pulleys that drive things like the alternator, power steering, air conditioner, etc."
    },
    {
      "Alternator Belt Replacement": "What does Alternator Belt Replacement entail? The alternator is a generator that converts mechanical energy into electrical energy. It uses the revolving motion of a magnetic field around a stationary armature creating electricity which is then stored in the car’s battery and operate electrical functions. The revolutions needed to create the electricity come from the engine’s crankshaft which is connected via a rubber belt. This alternator belt is either a v-belt or a flat ribbed belt more commonly known as a serpentine belt. The alternator belt may solely operate the alternator or it may also drive other items such as the water pump, air conditioning compressor, and the power steering pump. When the belt is loose, frayed or broken, the alternator isn’t able to generate electricity to charge the car battery causing poor operation of electrically powered accessories."
    },
    {
      "Power Steering Belt Replacement": "What does Power Steering Belt Replacement entail? Power steering is a system that helps steer the vehicle so that only a modest amount of effort is required from the driver. The power steering belt is made of flexible material with one flat side and one grooved side. The belt is wrapped around several pulleys while maintaining a certain amount of tension on the belt at all times. In modern vehicles, one belt, called the serpentine belt, controls the entire system. Older car models, such as those produced before the late 1990s, might have multiple belts with each one controlling a single component. The modern serpentine belt moves power along to several components of the engine, including the power steering system, alternator and air conditioning system. The driver must exert far more energy when the belt is broken because the power steering components will not turn."
    },
    {
      "AC Belt Replacement": "What does AC Belt Replacement entail? The AC belt connects the engine’s crankshaft to the air conditioner and without the AC belt, the air conditioner will not work. In some vehicles, the defrost function may be limited or even non-functioning if the AC belt is broken."
    },
    {
      "Supercharger Belt Replacement": "What does Supercharger Belt Replacement entail? Many conventional cars operate with superchargers. It is an air pump that increases airflow in an internal combustion engine. By forcing more air into the engine during each intake cycle, it burns more fuel and does more work. In order to pull in that extra air, superchargers rely on a belt that attaches to the supercharger drive pulley to your vehicle’s crankshaft. When the engine is running, there is a direct correlation between the amount of air being pumped into the engine and the RPM’s. At higher revolutions per minute, more air is forced into the engine. If the supercharger belt breaks or is damaged, it will not produce the proper amount of air for the engine to run efficiently. The engine light may come on and the fuel consumption will dramatically increase."
    },
    {
      "AC Recharge": "What does AC Recharge entail? For an AC system to work, it needs a gas or liquid substance called refrigerant (R-12 in older cars, R-134a in 1995 and newer cars). Over time, refrigerant can leak from the AC system through seals. If the AC does not have enough refrigerant, it will not blow cold air."
    },
    {
      "Bleed Brakes": "What does Bleed Brakes entail? Brake fluid maintenance is essential for good, safe brake performance. Without brake fluid, brakes will not function. When you push the brake pedal, the brake fluid causes the brake pads to press against the rotors, making the car slow down and stop. Overtime, the brake fluid absorbs air and moisture from the atmosphere and gets contaminated. For smooth operation, the brake fluid should be pure liquid and free from air bubbles. Air in brake fluid causes braking to feel spongy and reduces braking efficiency, significantly. Flushing brake fluid removes the existing fluid and moisture out of the system. Mechanic will fill the brake system with new brake fluid. After a brake fluid flush, the brake performance should significantly improve. You will immediately notice that pushing the brake pedal is harder."
    },
    {
      "Brake System Flush": "What does Brake System Flush entail? Brake fluid is essential for the operation of a car’s brakes. When you push the brake pedal, the brake fluid causes the brake pads to press against the rotors, making the car slow down and stop. Over time, the brake fluid absorbs air, moisture, sludge and other contaminants and gets contaminated. Air in the brake fluid causes braking to feel spongy and significantly reduces braking efficiency. A brake system flush includes removing the existing fluid and moisture out of the system and replacing it with new, clean, fluid. A brake fluid flush ensures proper brake system performance and increases the lifespan of your brake system components."
    },
    {
      "Change Oil and Filter": "What does Change Oil and Filter entail? Engine oil is the lifeblood of the engine. The oil resides in the oil pan, which is under the car attached to the bottom of the engine. All internal (moving) parts of the engine need to be lubricated by the engine oil. Inadequate lubrication will cause the parts to wear out faster and eventually lead to engine failure. An oil filter keeps the oil clean and free of debris. If the filter is not replaced on a regular basis, it will get clogged and will not be able to pass oil into the engine."
    },
    {
      "Cooling System Flush": "What does Cooling System Flush entail? Your cooling system is what keeps your car from overheating. It works by circulating a mixture of water and coolant through the engine. Over time the coolant mixture becomes contaminated with scale and rust, which can clog and damage the cooling system components. A cooling system flush essentially flushes out the entire system of contaminants and replaces the coolant mixture with fresh coolant and water."
    },
    {
      "Radiator Flush": "What does Radiator Flush entail? A radiator flush is undertaken to clean out all of the old coolant and anti-freeze mixture in your car’s cooling system. By pumping quantities of radiator cleaning solution through the system, the process removes contaminants, scale and rust particles that build up over time, allowing a new, clean and fresh mixture to take its place."
    },
    {
      "Lubricate U-Joints": "What does Lubricate U-Joints entail? U-joints, or universal joints, are found along the driveshaft or driveshafts of a vehicle, at any point where the driveshaft has to change angle or attach to another component such as a differential. This type of coupling is capable of withstanding large amounts of torque. Proper lubrication ensures that these parts don’t experience any excess friction and won’t wear out prematurely."
    },
    {
      "Lubricate Ball Joints": "What does Lubricate Ball Joints entail? Good suspension allows the wheels to move over bumps and potholes smoothly while making the car experience a very small amount of the jolt. In order for the wheels to move freely of the vehicle’s body, joints connect parts together while allowing them to move around. On parts that need to move in multiple directions at the same time, ball joints are the only solution."
    },
    {
      "Lubricate Suspension": "What does Lubricate Suspension entail? The suspension allows the wheels of a vehicle to roll over bumps and through potholes while keeping the car in control and the passengers comfortable. Numerous parts in the suspension system move around and connect to the vehicle via joints. Common joints include ball joints and u-joints. Proper lubrication keeps moving parts moving. Some connections in the suspension will contain bushings that could benefit from lubrication as well."
    },
    {
      "Clean and Repack Wheel Bearing": "What does Clean and Repack Wheel Bearing entail? A car’s wheels rotate on tapered-roller bearings which fit between the stationary axle spindle and the rotating wheel’s hub/brake mechanism. There are bearings on the inner and outer side of the hub to properly support the wheel. These are greased when installed, but the grease can, and does, break down over time, allowing dry contact between the various elements. When left unattended, this will lead to wear and, ultimately, to bearing failure."
    },
    {
      "Lubricate Doors": "What does Lubricate Doors entail? Doors allow the driver and passengers to enter and exit the vehicle. They are usually supported by their hinge at one end and a latch at the other end. Some doors operate on a track, allowing the door to slide open rather than swing. When a door is open, the full weight of the door, window, and locking mechanism is supported only by the hinge."
    },
    {
      "Lubricate Hood Hinge": "What does Lubricate Hood Hinge entail? The hood of a vehicle is a movable panel that covers the engine. Hinges hold the hood to the rest of the vehicle. When the hood closes, the hinges ensure that the hood latches properly in the same position each time."
    },
    {
      "Lubricate Trunk": "What does Lubricate Trunk entail? The trunk is a storage compartment usually located at the rear of the vehicle. This area is accessible via either a lid or a door. The hinges allowing the door to open and close smoothly need to remain lubricated in order to operate properly."
    },
    {
      "Service Battery/cables": "What does Service Battery/cables entail? In order for everything to operate properly in your car, the battery and its cables should be in optimal condition. By its very nature, a battery can cause corrosion, and cables can become loose or frayed, or touch other parts of the under hood area. Checking that all is well with the battery and its attachments is a wise idea for trouble free motoring."
    },
    {
      "Reset Indicator Lights": "What does Reset Indicator Lights entail? Since the dawn of the electronic age, cars have been fitted with service indicator lights. These are intended to remind the owner that the vehicle should have an oil change or inspection service. They should not be confused with the car’s diagnostic system, which checks for actual component or system malfunction. Most early indicators were simply time based, but many use an actual computer algorithm to analyze vehicle use based on the number of times it has been started, how often it has been run at wide open throttle, how high the revs have gone, and other operating parameters. Sometimes, the light stays on even after the owner has had an oil change and an inspection, either because they are of the simple type, or because the light was not reset after the car’s service. Some of these lights have to be reset by a diagnostic tool, but many can be reset manually. The procedure for this varies by make and model."
    },
    {
      "Valve Clearance Adjustment": "What does Valve Clearance Adjustment entail? Your engine is a perfectly timed machine that relies on many components working in harmony. The engine valves are one of the primary components of this operation. The valves are placed at the top of the cylinders, and open to allow the fuel mixture to enter the cylinder chamber, and then close to help create compression. The valves are opened by cams or rocker arms on the camshaft, which push the valve’s tappet, which forces the valve to open. If the clearance between the valve stem and the cam or rocker arm isn’t perfect, the valve will open and close at the wrong time, or may not close all the way. Adjusting the valve clearance will resolve this issue."
    },
    {
      "Recharge Diesel Emissions Fluid": "What does Recharge Diesel Emissions Fluid entail? Modern so-called clean diesel vehicles use a solution containing urea and ionized water to help control exhaust emissions. The solution is injected into the exhaust stream, where it reacts with the vehicle’s catalyst to reduce harmful emissions in the exhaust stream. The diesel emissions fluid is carried onboard in its own reservoir. They are typically quite large, allowing very extensive mileages before requiring replenishment. The tanks are usually fitted with a special spout connector to ease refills, but they can be located in places that require the removal of other parts."
    },
    {
      "Lubricate Driveshaft": "What does Lubricate Driveshaft entail? Along the drivetrain, whenever torque needs to travel from one place to another, a driveshaft is used. Some cars have two driveshafts under them, usually for four-wheel-drive applications. U-Joints are couplings that hold sections of driveshaft together and can withstand large amounts of torque. The U-joint and the slip both need lubrication to work smoothly. This means lubricant needs to be applied to every point where the driveshaft meets another section of shaft or any other part of the vehicle."
    },
    {
      "Lubricate Steering and Suspension": "What does Lubricate Steering and Suspension entail? The steering and suspension systems work together to make the vehicle handle smoothly and comfortably. Proper lubrication is required to keep things operating correctly, as every moving part (of which there are many) experiences friction. Every component between the body of the vehicle and the wheels plays an important role in keeping everything moving down the road."
    },
    {
      "Adjust Drum Brakes": "What does Adjust Drum Brakes entail? In older vehicles (usually ones manufactured before 1999), the rear brakes are drum brakes. The drum is a large medal cylindrical housing with brake shoes attached to it. When you press on the brake pedal, brake fluid helps the brake shoe apply pressure to the brake drum, which slows down your vehicle. Over time, the brake drum will wear thin, as constant friction with the brake shoe wears the drum away. When this happens the drum brakes will need to be adjusted to keep them close to the shoe, so that braking is still efficient."
    },
    {
      "Adjust Drive Belts": "What does Adjust Drive Belts entail? The drive belts are connected to the crankshaft (a part of the engine), as well as to the alternator, air conditioning, and power steering system. The belts are responsible for transferring power from the crankshaft to these other systems. Over time, and especially if multiple systems that put stress on the belts are being used, the belts can grow loose, or unaligned. When this happens the belts will need to be adjusted so that they can return to their normal, optimal position."
    },
    {
      "Adjust Clutch": "What does Adjust Clutch entail? Your clutch is what allows your vehicle to change gears. When your car is running, the engine is connected to the transmission through two gears. When you deploy the clutch pedal, these gears become separated, which allows you to switch gears. When you let go of the clutch pedal, the engine’s gear and the chosen transmission gear become engaged again. The clutch pedal is connected to the clutch operating lever (which engages and disengages the gears) via the clutch cable. When this cable develops too much or too little slack, the clutch pedal will not work correctly, and it will need to be adjusted."
    },
    {
      "Adjust Ignition Timing": "What does Adjust Ignition Timing entail? Your engine relies on perfect timing to work smoothly and efficiently. This requires ideal ignition timing. The ignition system is responsible for creating the spark that combusts the fuel that powers the cylinders and therefore the engine. In order to have your engine run perfectly, the ignition has to create a spark at the optimal time. As miles accumulate, your ignition system may start to spark at the wrong time, and the timing will need to be adjusted."
    },
    {
      "Adjust Parking Brake Cable": "What does Adjust Parking Brake Cable entail? The parking brake (also known as emergency brake) cable is a steel cable that is very thin. It connects the parking brake lever to the parking brake shoes. When you activate the parking brake, the cable pulls on the parking brake shoes, which causes them to clamp onto the brake drum or rotor. If the parking brake cable gets too much slack, the parking brake won’t work, and the cable will need to be adjusted."
    },
    {
      "Adjust Throttle Valve Cable": "What does Adjust Throttle Valve Cable entail? The throttle valve cable is a key component of a transmission system. The throttle valve cable is responsible for maintaining proper shift feel, controlling line pressure, and both partial and full throttle downshifts. The throttle valve cable is connected to the throttle lever, and is responsible for controlling it. Regardless of how much torque your engine is generating, the throttle valve cable will be able to keep the shift feel and transmission line pressure in balance."
    },
    {
      "Clean Throttle Body": "What does Clean Throttle Body entail? In order to run efficiently and smoothly, your vehicle needs a fuel mixture that is a perfect combination of air and gas. The air intake system is responsible for providing the air part of this equation. The throttle body is the component of the air intake system that determines exactly how much air to let combine with the fuel. When the throttle body is dirty it’s unable to let the right amount of air into the engine."
    },
    {
      "Clean Evaporator Drain Tube": "What does Clean Evaporator Drain Tube entail? The evaporator drain tube allows your air conditioning system to dispose of the condensation created by the air conditioning unit’s evaporator coil. You may have noticed that a home air conditioning system sometimes drips water. That happens in your car as well, but the evaporator drain tube drains it from the system and out of the vehicle. When the drain tube needs cleaning it can fail to do its job."
    },
    {
      "Tighten Wheel Lug Nuts": "What does Tighten Wheel Lug Nuts entail? Whenever a car’s wheel has been taken off, it should be replaced and the lug nuts properly tightened. By properly, we mean with a torque wrench that tightens the nuts to the manufacturer’s specification. Many workshops simply use air wrenches that frequently over tighten the lug nuts. This is potentially dangerous and destructive, because it can damage the wheel, stud and lug nut, as well as warp the disc brake rotor."
    },
    {
      "Pressure Test Radiator Cap": "What does Pressure Test Radiator Cap entail? In a pressurized cooling system like those found on all cars, your car’s radiator cap is calibrated to seal in coolant to a particular pressure point, then allow some vapor to escape once that threshold has been reached. The ejected fluid is piped into the overflow bottle you might have seen in the engine bay. Then, as the engine cools, the coolant level may drop inside radiator. When that happens, a reverse-flow valve in the radiator cap opens to allow fluid from the bottle to return to the radiator. A radiator cap that isn’t working properly may cause too much fluid to escape the system."
    },
    {
      "Power Steering Fluid Service": "What does Power Steering Fluid Service entail? Power steering fluid flows through the power steering hydraulic system. The system is pressurised by the power steering pump and by way of valves, plungers, or pistons decreases the effort needed by the driver to turn the steering wheel. When the pump stops pumping, the pressure drops and the power steering system loses its hydraulic pressure. As components in the steering system wear, metal particles will contaminate the fluid, which will cause seals in the system to leak and components to eventually fail. Checking the fluid level and changing the fluid at regular intervals recommended by the manufacturer is important for the life of the hoses, pistons, valves, seals, and the power steering pump itself."
    },
    {
      "Trunk Latch Adjustment": "What does Trunk Latch Adjustment entail? It’s about a good tight fit for your trunk and keeping water away from your valuables. On vehicles with batteries, modules and fuses in the trunk area, the latch serves an extremely important purpose in the safe operation of your vehicle. The trunk latch can be anything from a metal hook and locking mechanism built into the center of your trunk, to a maze of wires, motors and sensors that must be in perfect operation for the latch to operate properly. If one of these components is not installed properly or is malfunctioning, you may have a trunk that may lock only on one side or not lock at all."
    }
  ],
  "Brakes": [
    {
      "ABS Speed Sensor Replacement": "What does ABS Speed Sensor Replacement entail? Most modern vehicles have anti­-lock brake systems that use sensors to detect wheel rotation rates, reporting to a computer that is able to modulate brake pressure if one or more wheels should lock during a braking operation. Usually the sensor is a Hall­effect, or so-­called reluctance component, which looks at a toothed ring (called a tone ring) that is affixed to the wheel or axle. The teeth passing by the sensor creates a wave form that can be recognized and interpreted by the ABS controller. On three-channel ABS systems (typically found on older pickups), the rear axle is monitored by one sensor while the front wheels have their own individual sensors and anti­-lock control. Four-channel systems monitor each wheel independently."
    },
    {
      "Wheel Speed Sensor Replacement": "What does Wheel Speed Sensor Replacement entail? A wheel speed sensor, also called an 'ABS sensor,' is part of the Anti-lock Brake System (ABS). It is located on the tires (near the brake rotors for the front tires and in the rear end housing for the rear tires). The job of the wheel speed sensor is to constantly monitor and report the rotational speed of each tire to the ABS control module. ABS is a safety system that prevents your car from skidding or sliding when you apply the brakes. When the brake is applied, the ABS control module reads the speed data from the speed sensor and sends the correct pressure to each wheel to prevent any sliding/skidding (wheels locking up). On cars that come with rotors in each tire, each tire will also have a speed sensor. On cars that have rear drums (instead of rotors), the tires will have one sensor in the rear and two sensors in the front. When one or more of these sensors are faulty, the ABS warning light will go on and the ABS will be disabled. You will still be able to slow down and stop your car, but the tires may slide when you apply brakes, esp. on slippery surfaces."
    },
    {
      "Brake Drum Replacement": "What does Brake Drum Replacement entail? A brake drum is a heavy, cast iron brake system part that looks like a shallow, several inches-high cylinder about 9 to 12 inches in diameter. The brake drum has a precisely machined surface all around the interior circumference, that the brake shoes make contact with when you apply the brakes, transmitting hydraulic pressure through the wheel cylinder. This forces the brake shoes outward against the interior of the brake drum, resulting in the friction that causes the car to slow. The brake drum is mounted over, and fully encloses, all of the rear brake components such as the wheel cylinder, springs and clips, brake shoes, and parking brake mechanism. The drum is commonly held to the wheel hub by the wheel and the lug nuts, but some configurations combine the drum with the wheel hub as one unit. Nowadays, a drum brake type system is only installed on the rear axle, if used at all, as 4 wheel disc type systems have become more common."
    },
    {
      "Brake Caliper Replacement": "What does Brake Caliper Replacement entail? Most cars come with disc brakes in the front, and many models also have disc brakes in the rear. A caliper is part of the disc brake system. When you press the brake pedal, the brake fluid flows from the master cylinder to the calipers. Brake fluid then applies pressure on the piston inside the caliper, pushing the brake pads against the rotors to slow/stop your car. A car can have either 2 or 4 calipers. If the car has rotors on all four tires, then it will have four calipers. If the car has two rotors and two drums, then it will come with two calipers in front. The calipers can become contaminated, rusty, and start to leak brake fluid. Brake calipers absorb a lot of heat generated from the braking system. Over time, this heat can destroy or weaken the seals inside the calipers. Caliper servicing is usually done as part of a brake service job."
    },
    {
      "Brake Hose Replacement": "What does Brake Hose Replacement entail? The hydraulic steel brake lines that carry brake fluid in your car are bolted to the frame of the vehicle. These metal brake lines must eventually attach to the individual wheel calipers — or wheel cylinders in the case of drum brakes — at all four wheels. Since the wheels constantly move up and down, or left and right in the case of the front wheels, the brake line that attaches to the individual wheel calipers must be highly flexible. Enter the brake hose: a flexible, synthetic, reinforced-rubber hose designed to withstand the 1,000 PSI plus pressures that occur when you apply the brakes. There is at least one brake hose at each wheel position, and sometimes two depending on the suspension design. At the end of each rubber hose are steel connections with seals to maintain a leak-proof connection."
    },
    {
      "Brake Master Cylinder Replacement": "What does Brake Master Cylinder Replacement entail? The brake master cylinder has a piston that pressurizes fluid in the brake lines to each wheel cylinder as you apply force to the brake pedal. That pressure moves the pistons that are in the wheel cylinders. As the pistons in those wheel cylinders move, they force the brake pads or shoes tightly against the rotors or drums allowing the car to stop quickly. The size of the pistons in the master cylinder and in the wheel cylinders are carefully selected when designing a car. This allows drivers to apply moderate pressure on the brake pedal when stopping, but creates tremendous pressure applied at the wheel cylinders. A car can then stop quickly even at high speeds. Depending on how much force is applied to the brake pedal, the pressure in a car’s brake lines will typically be in the range of 800 PSI to 2,000 PSI."
    },
    {
      "Brake Pads Replacement": "What does Brake Pads Replacement entail? Brake pads consist of friction material that is bonded to a sturdy steel backing plate. When you push on the brake pedal, the friction material on the brake pads is forced against the inner and outer surfaces of the steel brake rotor under tremendous pressure. The resulting friction causes the wheels on your car to slow rapidly allowing for a quick, safe and controlled stop. After thousands of miles, this friction material eventually wears away, and the brake rotor wears away as well, requiring replacement."
    },
    {
      "Brake Rotor/Disc Replacement": "What does Brake Rotor/Disc Replacement entail? A brake rotor is a smooth metal disc attached to the wheel hub. Most new cars (1999 and above) come with rotors at each wheel. Older cars may have drums instead of rotors at the rear wheels . Brake rotors play an important part in the braking system. It is the friction between brake pads and rotors that cause your car to slow down and stop. As the rotors wear out (become thin or warped), they are unable to dissipate the heat caused by the braking system. This will cause the brake fluid to boil and reduce the effectiveness of brake system significantly."
    },
    {
      "Brake Shoes (Rear) Replacement": "What does Brake Shoes (Rear) Replacement entail? Brake shoes are found only at the rear wheels in cars with a drum brake system. When you step on the brake pedal, brake shoes press against the brake drums to cause friction that slows down the car. Brake shoes usually last twice as long as brake pads."
    },
    {
      "Emergency / Parking Brake Shoe Replacement": "What does Emergency / Parking Brake Shoe Replacement entail? The job of the parking brake shoes is to hold the car in place (prevent the car from rolling) when you use the parking or emergency brake. Parking brake shoes are installed on cars that have rear rotors (also known as rear disc brakes). Most new cars (made after 1999) have rotors at the rear wheels. In the older cars that have drums at the rear wheels, the brake shoes inside the rear drums act as the parking brake shoes."
    },
    {
      "Brake System Flush": "What does Brake System Flush entail? Brake fluid is essential for the operation of a car’s brakes. When you push the brake pedal, the brake fluid causes the brake pads to press against the rotors, making the car slow down and stop. Over time, the brake fluid absorbs air, moisture, sludge and other contaminants and gets contaminated. Air in the brake fluid causes braking to feel spongy and significantly reduces braking efficiency. A brake system flush includes removing the existing fluid and moisture out of the system and replacing it with new, clean, fluid. A brake fluid flush ensures proper brake system performance and increases the lifespan of your brake system components."
    },
    {
      "Vacuum Brake Booster Check Valve Replacement": "What does Vacuum Brake Booster Check Valve Replacement entail? The vacuum brake booster check valve is part of the brake booster, and plays an essential role in brake system operation. It is a one-way valve that allows air to be sucked out of the booster, but does not allow air to enter it. This is a safety solution to ensure that if the engine is turned off, or if frequent stops or pedal presses are required, the brakes still operate. Its capacity ensures that you have enough boost for several brake applications. The vacuum brake booster check valve connects the vacuum hose from the engine to the body of the brake booster."
    },
    {
      "Vacuum Pump Replacement": "What does Vacuum Pump Replacement entail? While all gasoline engines create vacuums during operation, sometimes the amount created isn’t enough to power the accessory systems in the car. Diesel engines do not create vacuums at all during operation. In both of these instances, a vacuum pump is used to either augment or provide the vacuum power necessary to operate the various other systems on the car, including the brakes, some HVAC functions and more. The vacuum pump is usually located behind the engine, mounted near the firewall and close to the master cylinder and brake booster. It’s easily recognizable for its two nozzles on top, as well as the design of the canister. It is an electric air pump that maintains a constant amount of vacuum in the vacuum reservoir behind the front bumper. If the vacuum pump stops working or develops a leak, the engine compartment may release a hissing sound, the heater controls may not switch when operated, or the brake pedal may be hard to depress."
    },
    {
      "Emergency Brake Control Replacement": "What does Emergency Brake Control Replacement entail? Your vehicle is equipped with brakes on all four wheels to slow down and stop your vehicle while driving, and to hold your vehicle in position when you are engaged in gear. When your vehicle is equipped with an automatic transmission, a parking pawl is engaged when you put your shifter in park. But when you are parked on an incline, or if your vehicle is equipped with a manual transmission, what prevents your vehicle from rolling? Every vehicle is equipped with a parking brake, or emergency brake, that is manually applied for those circumstances. An emergency brake pedal is pressed by foot and released by pressing a second time or pulling a release handle. A parking brake, or handbrake lever, is engaged by pulling up on it and released by pressing a button on the end of the lever and lowering the handle. In either situation, an emergency brake cable is attached to the mechanism and connects to the rear brakes. When the lever or pedal are engaged, the cable is pulled and the emergency brake shoes in the rear brakes are locked in place. The vehicle is not able to roll. If the emergency brake control lever or pedal will not hold in place, or will not engage the parking brake, it may require repairs."
    },
    {
      "Parking Brake Release Cable Replacement": "What does Parking Brake Release Cable Replacement entail? Your parking brake only plays a role in safety after parking your car, but it’s an important part of automotive equipment. When you engage the brake, either by pulling the handle between the two front seats or pressing the pedal on the driver side, it engages a secondary braking system designed to help hold your car in place and alleviate unwanted pressure on your transmission. You need to release the brake before you can safely drive once more, and this is where the parking brake release cable comes into play. Depending on the setup in your specific vehicle, you’ll either push a release button, or push the pedal again to activate the release cable and disengage the parking brake. Without an operational brake cable, the e-brake won’t disengage, which can be problematic. Driving with the brake on is never a good idea."
    },
    {
      "Anti-Lock Control Relay Replacement": "What does Anti-Lock Control Relay Replacement entail? The term “anti-lock control relay” is something of a misnomer. The relay doesn’t operate the controller – the controller operates the relay. The relay itself is responsible for operating the pump, which pressurizes brake fluid in the ABS system’s accumulator. If the relay fails, then the pump will not operate and the fluid pressure in the accumulator will not build. The end result is that the ABS system won’t work. Essentially, the anti-lock control relay is used to energize the electric pump in some types of ABS systems. This will vary from one system to the next, and is dependent not on the automaker so much as on the manufacturer of the ABS system. Like other electrical components, the anti-lock control relay is subject to wear and tear. Over time, it’s possible that it will fail, although pump failure is more common than relay failure, and fuse failure is more common than both. In all instances, failure means that the ABS system will stop functioning and the ABS warning light will illuminate in the dash."
    },
    {
      "Anti-Lock Fuses Or Relay Replacement": "What does Anti-Lock Fuses Or Relay Replacement entail? Modern braking systems have advanced considerably from what they were even a few short years ago. Today’s anti-lock brakes offer better stopping ability and safety during hard stops and on slick surfaces (although they don’t provide appreciably better stopping performance during good driving conditions). And while you might think these systems are largely hydraulic in nature, they’re actually more electronic. They require a number of electronic components in order to operate, and they need fuses and at least one relay. There are two primary fuses involved with the operation of a standard ABS system, although this varies significantly from one vehicle to the next and the exact number and configuration will depend on the ABS system manufacturer (not the automaker). One fuse allows power to flow into the system when the key is turned to on, activating the relay and closing it. Once the relay closes its contacts, the second fuse allows power to flow into the rest of the ABS system. If either fuse or the relay is blown, the system will not operate."
    }
  ],
  "Engine": [
    {
      "Fuel Filter Replacement": "What does Fuel Filter Replacement entail? The fuel filter is made of cellulose or synthetic-based filter media that traps extremely tiny contaminants, such as rust particles and dirt, present in the fuel as it flows from the fuel tank to the fuel injectors. The filter media is sealed within a cylindrical shaped housing that looks like a tiny soda can. You will most often find the fuel filter plumbed into the high-pressure fuel supply line beneath the car, right next to a sturdy frame rail. Some fuel filters, particularly on diesel-powered vehicles, have water traps as well. Some newer cars do not have serviceable fuel filters as the filter is built into the fuel pump located in the fuel tank."
    },
    {
      "Fuel Injector Replacement": "What does Fuel Injector Replacement entail? A fuel injector is a fuel metering device that sprays atomized droplets of fuel in a specific pattern into the engine’s intake manifold or directly into the combustion chamber. The injector has a solenoid and valve within and the operation, or pulsing, of the solenoid is controlled by the powertrain control module (PCM). The PCM controls the solenoid’s “on” time in order to keep the air-fuel ratio optimized while the engine load and operating conditions constantly change. Fuel injectors are usually connected to a fuel rail located on the top of the engine and the fuel rail, in turn, is supplied with fuel under pressure from the fuel pump located in the fuel tank."
    },
    {
      "Fuel Pressure Regulator Replacement": "What does Fuel Pressure Regulator Replacement entail? Cars need to run at a specific fuel pressure. The regulator controls the fuel pressure and returns any excess fuel to the tank. The regulator is important to ensure that the injectors operate properly. If the regulator malfunctions, it can cause the engine to flood. In extreme cases, a flooded engine can be a fire hazard. You may see liquid on the floor near the exhaust pipe (raw gas dripping from the tail pipe). You may also notice black smoke when the engine is running (partially burnt gas produces black smoke). Not only will the car get poor gas mileage, it also may not pass an emissions test."
    },
    {
      "Fuel Pump Replacement": "What does Fuel Pump Replacement entail? The fuel pump supplies pressurized gasoline to each of the fuel injectors in a car’s engine. The fuel pump is powered by a compact electric motor and is located in the vehicle’s gas tank. The pressure and output of the pump are controlled by a regulator. Filtration of the fuel occurs either in the fuel tank using a pickup screen or externally with a replaceable filter mounted in the fuel supply line."
    },
    {
      "Oxygen Sensor Replacement": "What does Oxygen Sensor Replacement entail? With each new model year, manufacturers are adding more oxygen sensors to better manage engine operation. Some high performance engines have an oxygen sensor for each cylinder as well as one for the rear of each catalytic convertor. The sensors are located either underneath the hood or underneath the car. The oxygen sensors are connected (screwed) to the exhaust pipe, either in front or back of the catalytic converter. The front (upstream) sensors measure the amount of oxygen in the exhaust system. The purpose of the front oxygen sensor(s) is to measure how rich or lean the gases are as the gases exit the combustion chamber. Depending upon whether the exhaust gas is lean (high in oxygen content) or rich (low in oxygen content), the amount of fuel entering the engine is adjusted by the engine management computer to try and maintain an ideal mixture that produces the lowest emissions output from the catalytic convertor. Rear (downstream) sensors are located behind the catalytic converter. The purpose of the rear oxygen sensor(s) is to monitor the oxygen content of the exhaust gases leaving the catalytic convertor. If one or more of the oxygen sensors are faulty, your car may not pass the emissions test. If you drive your car with a faulty oxygen sensor, you may get poor gas mileage and it can damage the catalytic converter."
    },
    {
      "Gas Cap Replacement": "What does Gas Cap Replacement entail? The purpose of a Gas Cap is twofold: one, it helps prevent dust and other particles from getting into the gas tank, and two, it helps prevent fuel emissions from entering the atmosphere. If your gas cap is faulty, the Check Engine light may come on. Additionally, your vehicle may fail a smog test if the gas cap is gone or not functioning properly."
    },
    {
      "Fuel Filler Neck Replacement": "What does Fuel Filler Neck Replacement entail? The fuel filler neck is a part that connects the gas cap and the fuel tank. It may be a metal hose that is soldered to the fuel tank, or a rubber hose that uses hose clamps to hold the neck to the gas tank. When the neck is metal, it is made of lightweight aluminum, steel or chrome plating. Modern necks are powder-coated to increase their lifespan. While they are designed to be long-lasting, corrosive chemicals can cause them to wear and rust over time. They will develop holes and cracks that allow the fuel to leak out. Not only does this create a fire hazard, but it allows dust and debris to seep inside and reduce the performance of your vehicle. Accidents or collisions can also damage the fuel filler neck. While it can be temporarily patched with an adhesive, replacement is often the better long-term fix."
    },
    {
      "Fuel Gauge Sender Replacement": "The fuel gauge sender is a fairly simple component that is located in your car’s fuel tank. It consists of a float that is connected to a metal rod. The end of this thin rod is mounted to a resistor, which measures electrical flow. When there is more resistance, less current flows. A slider connected to the fuel gauge slides on the metal strip, and delivers current to the resistor from the gauge. If the slider is close the grounded side, there is less resistance, and if it’s at the end of the strip, there is more resistance. The fuel gauge on your dash interprets the resistance and indicates the fuel level with a needle on your cluster. If the fuel gauge sender isn’t working, you will get an inaccurate reading on your fuel gauge."
    },
    {
      "Fuel Filler Cap Replacement": "What does Fuel Filler Cap Replacement entail? Your fuel filler cap is one component in your car that you handle regularly if you pump your own gas. It’s also known as the “gas cap,” and it’s that plastic cover that screws onto and off of your fuel inlet tube so that you can pump gas into your tank, and keep contaminants out of your gas once you’re done pumping. It also provides a seal for the fuel system so the fuel tank can pressurize for emissions testing. If the fuel cap is missing or does not seal properly, the Check Engine light will come on."
    },
    {
      "Carburetor Replacement": "What does Carburetor Replacement entail? Before fuel injection systems became mainstream, the air/fuel mixture was controlled by a carburetor. The carburetor is mounted on the top of the intake manifold, and has both air and fuel inlets. The air inlet is sometimes a duct attached to the carburetor or can be just an air filter housing mounted directly on top of the carburetor. The fuel is supplied by a fuel line coming from the fuel tank. The carburetor is responsible for atomizing fuel and spraying it into the air that enters the intake manifold. There are two adjustment screws on a carburetor that control the idle speed and the fuel mixture when running. When the carburetor can no longer be adjusted to make the engine run smoothly, it may be time to replace the carburetor."
    },
    {
      "Fuel Injector O Rings Replacement": "What does Fuel Injector O Rings Replacement entail? Fuel injector O rings are rubber gaskets around the end of the fuel injectors that hold the injectors up tight to the rest of the cylinders of your engine, and prevent fuel from leaking. If they’re not properly mounted, or if they’ve begun to deteriorate, you will lose fuel. They work like any other gasket – they will wear and crack as they age, and at some point will require replacement."
    },
    {
      "Fuel Pressure Sensor Replacement": "What does Fuel Pressure Sensor Replacement entail? In fuel-injected and diesel engines, fuel rail pressure sensors monitor the pressure in the fuel rail and report the reading to the engine control module. If any drop in pressure is detected, the engine control module compensates so that the fuel pump can restore the proper pressure. A valve controls this pressure; if the sensor ever fails, you should replace it. Sometimes, the entire fuel rail may need to be replaced, but the sensor is a weak point in the loop that is more prone to damage. If the sensor is working properly, only the amount of fuel that is needed to make the engine run properly will be delivered. Minimal excess fuel will be circulated back to the tank in the fuel return line."
    },
    {
      "Injector Control Pressure Sensor Replacement": "What does Injector Control Pressure Sensor Replacement entail? In a fuel injection system, it’s important that the computer has information concerning the amount of fuel pressure in the rail at all times. This information is necessary for the computer to determine the actual injector timing, the width of each pulse, and the pressure required during operation. In some diesel engines (notably many Ford engines), this job is done by the injector control pressure sensor, or ICP. The sensor works on the basis of capacitance, and feeds an analog voltage signal to the vehicle’s computer that tells it how much pressure is in the rail. Like all other sensors, the injector control pressure sensor is subject to wear and tear and eventual failure through normal use. If it fails, the computer will be unable to determine the pressure in the rail, which will adversely affect the operation of the engine."
    },
    {
      "Alternator Replacement": "What does Alternator Replacement entail? The alternator is the component that charges the battery in your car. When you use electrical components in your car (stereo, lights, etc.), the battery loses power. The alternator recharges the battery, replenishing the lost battery power. The alternator is located in the engine compartment. If the alternator is not working properly, your car will only stay running for as long as the battery has power stored. Once the battery loses power, your car will not start. Normally, a malfunctioning alternator will turn on the battery warning light or will have a low volt gauge reading."
    },
    {
      "Crankshaft Harmonic Balancer Replacement": "What does Crankshaft Harmonic Balancer Replacement entail? The harmonic balancer (also called “crank pulley damper”), connected to the crankshaft of an engine, reduces engine vibration and serves as a pulley for the drive belts. The balancer or “damper” is composed of two elements: a mass and an energy-dissipating element. The mass resists the acceleration of the vibration and the energy dissipating (rubber) element absorbs the vibrations. When the balancer fails, it is usually due to heat, salt, and or ozone deterioration of the rubber. General wear, tear, and stress on the rubber is also a factor."
    },
    {
      "Exhaust Gas Recirculation/EGR Valve Replacement": "What does Exhaust Gas Recirculation/EGR Valve Replacement entail? The EGR (Exhaust Gas Recirculation) valve helps lower the car’s exhaust emissions (gases from the tailpipe). It recirculates the portion of the gasses coming out of the engine by putting in back into the intake manifold, where the engine can burn it again, thereby reducing the emissions. The EGR valve is located in the engine compartment (underneath the hood). Most engines require exhaust gas recirculation to meet emissions standards. If the EGR valve has gone bad, the car will not pass emissions."
    },
    {
      "Engine Mount Replacement": "What does Engine Mount Replacement entail? An engine mount, made of rubber and steel, has two purposes. One, it secures the engine and transmission to the frame of the car, and two, it absorbs the road shocks and engine vibrations so that the driver does not feel any engine movement. Transmission mounts secure the transmission. Most cars have multiple engine and transmission mounts. If one of the mounts breaks, you will feel significant engine movement (vibrations and/or shaking)."
    },
    {
      "Exhaust Manifold Gasket Replacement": "What does Exhaust Manifold Gasket Replacement entail? Depending on your engine and type of vehicle, the exhaust manifold can either be a set of pipes or it can be a cast iron manifold assembly. Essentially the exhaust manifold takes the burned exhaust gases from the engine’s cylinders and ejects the gas through the exhaust system and out through the cars tail pipe. The exhaust manifold gasket seals the surface of the exhaust manifold to the surface of the cylinder head, preventing leaks in the system. Over time, the constant expansion and contraction of the components (caused by constant heating and cooling in the engine), may cause the gasket to leak. These leaks can be hazardous as hot exhaust gases escape and can damage other components in the engine compartment. A leaky exhaust manifold gasket can also impact engine performance."
    },
    {
      "Exhaust Manifold Replacement": "What does Exhaust Manifold Replacement entail? Depending on your engine and type of vehicle, the exhaust manifold can either be a set of pipes or it can be a cast iron manifold assembly. Essentially the exhaust manifold takes the burned exhaust gases from the engine’s cylinders and ejects the gas through the exhaust system and out through the cars tail pipe. The exhaust gases are the burned fuel/air residue from the combustion process in the cylinders of the engine. Over time, the constant expansion and contraction of the components (caused by constant heating and cooling in the engine), may cause the manifold to crack and leak. These leaks can be hazardous as hot exhaust gases escape and can damage other components in the engine compartment. A leaky exhaust manifold can also impact engine performance."
    },
    {
      "Idle Control Valve Replacement": "What does Idle Control Valve Replacement entail? The Idle Control Valve is designed to control and maintain a consistent engine idle speed. The valve helps counter anything the driver may do to put extra load on the engine, such as turn on the air conditioning, sound systems, lights, etc. When the car is cold, the idle control valve helps the engine start."
    },
    {
      "Intake Manifold Gaskets Replacement": "What does Intake Manifold Gaskets Replacement entail? The intake on an engine may be made up of a lower intake manifold and an upper intake manifold or plenum. The lower intake manifold is a cast aluminum or molded plastic chamber bolted to the cylinder head of the engine. The intake manifold must be tightly sealed to the cylinder head(s) using a gasket in order to prevent air, oil, or engine coolant leaks."
    },
    {
      "Oil Pan Gasket Replacement": "What does Oil Pan Gasket Replacement entail? An oil pan is a metal container that contains the engine oil. The oil pan gasket seals the oil pan to the bottom of the engine. The engine has a lot of moving parts that need to be kept lubricated by the engine oil, without which the parts will damage each other. The oil pan and the gaskets are located under the car and are attached to the bottom of the engine. It is common for the gaskets to wear out and start leaking oil. You will see oil on the ground beneath your car. If the oil is leaking, you may see an engine oil warning light in the dashboard. If you continue to drive your car without the proper amount of oil, you will risk severe damage to the engine."
    },
    {
      "Positive Crankcase Ventilation (PCV) Valve Replacement": "What does Positive Crankcase Ventilation (PCV) Valve Replacement entail? The PCV Valve transfers gasses from inside the crankcase to the intake manifold where they are burned as part of the normal combustion process. Excess fumes are burned by the engine, rather than released into the atmosphere."
    },
    {
      "Cooling/Radiator Fan Motor Replacement": "What does Cooling/Radiator Fan Motor Replacement entail? Your vehicles engine is constantly burning fuel and gets hot. The car’s cooling system is responsible for carrying heat away to the outside air. The cooling fan motor powers the cooling fan, which keeps the engine from overheating. The fan is located in the engine compartment, at the front or rear of the radiator. The fan cools the coolant as it passes through the radiator. The coolant flows through the entire engine and is responsible for absorbing the extra heat and thereby preventing the engine from overheating. The fan blows the air from the outside and passes it through the radiator. If the cooling fan motor and the fan stop working, the coolant will remain hot and cause the engine to overheat."
    },
    {
      "Radiator Replacement": "What does Radiator Replacement entail? The radiator performs a critical function; it keeps the engine from overheating. While running, the engine produces heat. Coolant flowing through the system absorbs and removes extra heat from the engine. The coolant then passes through the radiator where it cools off and is later circulated back to the engine to absorb heat again. A radiator has two tanks that are connected to each other through aluminum or brass tubes. When the coolant passes through these tubes, the radiator cooling fan blows air across the radiator to lower the temperature of the coolant. The tank is usually made of plastic, and it is common for it to crack and start leaking coolant. If the tank or the tubes crack, coolant will leak , the vehicle will overheat and could cause severe engine damage. Radiators also tend to clog over time. When this occurs, not enough coolant flows through the radiator leading to heat build-up, causing the engine to overheat."
    },
    {
      "Serpentine/Drive Belt Replacement": "What does Serpentine/Drive Belt Replacement entail? A serpentine belt is a relatively long, flat, multi-ribbed belt that is driven by the engine’s crankshaft pulley. The belt drives many, and often all, of the engine accessories such as the alternator, air conditioning compressor, power steering pump, water pump, and air pump. The serpentine belt is tensioned by a hydraulic or spring-loaded automatic tensioner. Some older cars use a serpentine belt to drive most accessories but will also have a shorter v-style belt to drive, for example, the power steering pump."
    },
    {
      "Starter Replacement": "What does Starter Replacement entail? The starter motor is a powerful, compact electric motor that will turn a car’s engine over at about 200 RPM in order to start the engine. The starter is at the terminus of a circuit that includes the battery, the ignition switch, a neutral safety switch, relays and fuses. When you turn the ignition key to start, or press the start button in some vehicles, the starter circuit is completed and the starter will run. Most starters have a small pinion gear that engages a larger ring gear on the flywheel when the starter is powered on. The pinion gear turns the engine flywheel at about 200 RPM. Since the flywheel is directly connected to the crankshaft, all engine components will then turn in sync and the engine starts."
    },
    {
      "Thermostat Replacement": "What does Thermostat Replacement entail? The cars engine cooling system thermostat is a small valve within a cooling system passageway that opens and closes in response to the temperature of the circulating engine coolant. When your car is first started and the coolant is cold, the valve in the thermostat will be in the closed position, circulating the coolant flow only within the engine instead of flowing to the radiator, which allows the engine to warm up fast, promoting fuel efficiency, low emissions, and reduced engine deposits. Once the engine coolant reaches the design temperature, usually around 195 degrees, the valve will open and close as you drive in order to maintain a coolant temperature typically between 195 to 225 degrees Fahrenheit."
    },
    {
      "Throttle Body Replacement": "What does Throttle Body Replacement entail? The throttle body is an air metering device mounted between the air filter and snorkel, and the intake plenum. Within the throttle body is a movable throttle plate whose position controls the amount of air that enters the engine to determine engine speed. Throttle body designs vary. Some incorporate an idle air control valve, throttle position sensor, and other electronic throttle controls. The throttle plate in the throttle body can be controlled directly by an accelerator pedal cable or fully electronically in the newest drive-by-wire systems."
    },
    {
      "Valve Cover Gasket Replacement": "What does Valve Cover Gasket Replacement entail? Each cylinder head on your car’s engine has an aluminum or plastic valve cover bolted to it. Between this valve cover and the cylinder head, there is a gasket that keeps engine oil from leaking out. The valve cover bolts keep the gasket compressed, thus preventing leaks. Over time the gasket becomes brittle from the engine’s heat or the bolts loosen, creating an engine oil leak."
    },
    {
      "Water Pump Replacement": "What does Water Pump Replacement entail? The water pump is a belt or chain-driven engine accessory bolted to the engine above the crankshaft pulley. The pump housing has an impeller that circulates engine coolant through the cooling system passageways in the engine block and cylinder head, on to the radiator, where the coolant temperature is reduced. . The lower temperature coolant then flows back to the water inlet on the engine and the water pump continues the cycle."
    },
    {
      "Distributor Rotor and Cap Replacement": "What does Distributor Rotor and Cap Replacement entail? When the engine is running, high voltage created by the ignition coil travels through the coil wire to the ignition rotor. As the ignition rotor turns in the distributor, the rotor distributes the spark by sending it in a synchronized order through the spark plug wires to the spark plug located in each of the engines cylinders. The distributor is a main component of the ignition system. It takes very high voltage and delivers it to fire the spark plugs."
    },
    {
      "Exhaust Gas Recirculation (EGR) Tube Replacement": "What does Exhaust Gas Recirculation (EGR) Tube Replacement entail? The EGR (Exhaust Gas Recirculation) valve helps lower the car’s exhaust emissions (gases from the tailpipe). It recirculates a portion of the gasses coming out of the engine by putting them back into the intake manifold, where the engine can burn them again, reducing emissions. Most engines require exhaust gas recirculation to meet emissions standards. If the EGR valve has gone bad, the car will most likely not pass an emissions test."
    },
    {
      "Idler Pulley Replacement": "What does Idler Pulley Replacement entail? An idler pulley is responsible for guiding and maintaining tension with the drive belt. The drive belt (also called the serpentine belt) connects the engine to various components of the vehicle (such as the air conditioning, power steering, and alternator). Power is transferred from the engine to these systems via the drive belt. The belt is held in place by the idler pulley, which keeps the tension on the drive belt and guides it."
    }
  ]
}
